# The null hypothesis of a test always predicts no effect or no relationship between variables, while the alternative hypothesis states your research prediction of an effect or relationship

# QUESTION 1:
####      A F&B manager wants to determine whether there is any significant difference in the diameter of the cutlet between two units. A randomly selected sample of cutlets was collected from both units and measured? Analyze the data and draw inferences at 5% significance level. Please state the assumptions and tests that you carried out to check validity of the assumptions.

In [1]:
import pandas as pd
from scipy import stats

In [2]:
cutlets_data=pd.read_csv('Cutlets.csv')

In [3]:
cutlets_data.head(20)

    Unit A  Unit B
0   6.8090  6.7703
1   6.4376  7.5093
2   6.9157  6.7300
3   7.3012  6.7878
4   7.4488  7.1522
5   7.3871  6.8110
6   6.8755  7.2212
7   7.0621  6.6606
8   6.6840  7.2402
9   6.8236  7.0503
10  7.3930  6.8810
11  7.5169  7.4059
12  6.9246  6.7652
13  6.9256  6.0380
14  6.5797  7.1581
15  6.8394  7.0240
16  6.5970  6.6672
17  7.2705  7.4314
18  7.2828  7.3070
19  7.3495  6.7478

In [4]:
cutlets_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Unit A  35 non-null     float64
 1   Unit B  35 non-null     float64
dtypes: float64(2)
memory usage: 688.0 bytes

In [5]:
cutlets_data.isna().sum()

Unit A    0
Unit B    0
dtype: int64

In [9]:
a=cutlets_data['Unit A']
b=cutlets_data['Unit B']

In [11]:
statistics,p_value=stats.ttest_ind(a,b)

In [12]:

print('p_value:', p_value)

p_value: 0.4722394724599501

# h0 there is sifnificant diffrence
## ha there is no signifivant diffrence

In [66]:
if p_value<0.05:
    print('there is  significant diffrence')
else:
    print('there is no significant diffrence between two unit')

there is no significant diffrence between two unit

# QUESTION 2
###    A hospital wants to determine whether there is any difference in the average Turn Around Time (TAT) of reports of the laboratories on their preferred list. They collected a random sample and recorded TAT for reports of 4 laboratories. TAT is defined as sample collected to report dispatch.Analyze the data and determine whether there is any difference in average TAT among the different laboratories at 5% significance level.
Â

In [15]:
LAB_DATA=pd.read_csv('LabTAT.csv')

In [16]:
LAB_DATA

     Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0          185.35        165.53        176.70        166.13
1          170.49        185.91        198.45        160.79
2          192.77        194.92        201.23        185.18
3          177.33        183.00        199.61        176.42
4          193.41        169.57        204.63        152.60
..            ...           ...           ...           ...
115        178.49        170.66        193.80        172.68
116        176.08        183.98        215.25        177.64
117        202.48        174.54        203.99        170.27
118        182.40        197.18        194.52        150.87
119        182.09        215.17        221.49        162.21

[120 rows x 4 columns]

In [18]:
LAB_DATA.isna().sum()

Laboratory 1    0
Laboratory 2    0
Laboratory 3    0
Laboratory 4    0
dtype: int64

In [20]:
LAB_DATA.describe(include='all')

       Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
count    120.000000    120.000000    120.000000     120.00000
mean     178.361583    178.902917    199.913250     163.68275
std       13.173594     14.957114     16.539033      15.08508
min      138.300000    140.550000    159.690000     124.06000
25%      170.335000    168.025000    188.232500     154.05000
50%      178.530000    178.870000    199.805000     164.42500
75%      186.535000    189.112500    211.332500     172.88250
max      216.390000    217.860000    238.700000     205.18000

# The Null and Alternative Hypothesis


### h0 There is no significant difference between the groups' mean Lab values Î¼1=Î¼2=Î¼3=Î¼4=Î¼5
## ha there are significant differences between the groups' mean Lab values. H0:Î¼1â Î¼2â Î¼3â Î¼4

In [21]:
a=LAB_DATA['Laboratory 1']
b=LAB_DATA['Laboratory 2']
c=LAB_DATA['Laboratory 3']
d=LAB_DATA['Laboratory 4']

In [22]:
stas,p_value1=stats.f_oneway(a,b,c,d)

In [23]:
p_value1

2.1156708949992414e-57

In [65]:
if p_value1<0.05:
    print('there is significnat diffrence')
else:
    print('there is no significnat difference')

there is significnat diffrence

#       Sales of products in four different regions is tabulated for males and females. Find if male-female buyer rations are similar across regions.

In [26]:
buyer=pd.read_csv('BuyerRatio.csv')
buyer

  Observed Values  East  West  North  South
0           Males    50   142    131     70
1         Females   435  1523   1356    750

In [28]:
Male = [50,142,131,70]
Female=[435,1523,1356,750]
Sales=[Male,Female]

In [31]:
chi2_score3,p_value3,dof1,expected_value1=stats.chi2_contingency(observed=Sales)

In [32]:
print('chi2_square value :', round(chi2_score,5))
print('p_value:', p_value3)
print('degree of freedom:' ,dof)
print('Expected_value:/n', expected_value)

chi2_square value : 1.59595
p_value: 0.6603094907091882
degree of freedom: 3
Expected_value:/n [[  42.76531299  146.81287862  131.11756787   72.30424052]
 [ 442.23468701 1518.18712138 1355.88243213  747.69575948]]

In [33]:
if p_value3<0.05:
    print(' Not all Proportions are equal')
else:
    print('All proportions are equal')

All proportions are equal

#  qeustion 4:   TeleCall uses 4 centers around the globe to process customer order forms. They audit a certain %  of the customer order forms. Any error in order form renders it defective and has to be reworked before processing.  The manager wants to check whether the defective %  varies by centre. Please analyze the data at 5% significance level and help the manager draw appropriate inferences

In [54]:
customer=pd.read_csv('Costomer+OrderForm.csv')

In [55]:
customer

    Phillippines   Indonesia       Malta       India
0     Error Free  Error Free   Defective  Error Free
1     Error Free  Error Free  Error Free   Defective
2     Error Free   Defective   Defective  Error Free
3     Error Free  Error Free  Error Free  Error Free
4     Error Free  Error Free   Defective  Error Free
..           ...         ...         ...         ...
295   Error Free  Error Free  Error Free  Error Free
296   Error Free  Error Free  Error Free  Error Free
297   Error Free  Error Free   Defective  Error Free
298   Error Free  Error Free  Error Free  Error Free
299   Error Free   Defective   Defective  Error Free

[300 rows x 4 columns]

In [56]:
customer.isna().sum()

Phillippines    0
Indonesia       0
Malta           0
India           0
dtype: int64

In [57]:
customer.describe()

       Phillippines   Indonesia       Malta       India
count           300         300         300         300
unique            2           2           2           2
top      Error Free  Error Free  Error Free  Error Free
freq            271         267         269         280

In [59]:
Phillippines_value=customer['Phillippines'].value_counts()
Indonesia_value=customer['Indonesia'].value_counts()
Malta_value=customer['Malta'].value_counts()
India_value=customer['India'].value_counts()
print(Phillippines_value)
print(Indonesia_value)
print(Malta_value)
print(India_value)

Error Free    271
Defective      29
Name: Phillippines, dtype: int64
Error Free    267
Defective      33
Name: Indonesia, dtype: int64
Error Free    269
Defective      31
Name: Malta, dtype: int64
Error Free    280
Defective      20
Name: India, dtype: int64

In [60]:
chi2_score4,p_value4,dof4,expected_value4=stats.chi2_contingency(observed=[[271,267,269,280],[29,33,31,20]])

In [62]:
print('chi2_square value :', round(chi2_score4,5))
print('p_value:', p_value4)
print('degree of freedom:' ,dof4)
print('Expected_value:/n', expected_value4)

chi2_square value : 3.85896
p_value: 0.2771020991233135
degree of freedom: 3
Expected_value:/n [[271.75 271.75 271.75 271.75]
 [ 28.25  28.25  28.25  28.25]]

In [64]:
if p_value4<0.05:
    print(' we reject null hypothesis the defective % not varies by centre.')
else:
    print('we accept null hypothesis the defective  %  varies by centre.')

we accept null hypothesis the defective  %  varies by centre.